#ifndef RUSSIAN_NAMES_H
#define RUSSIAN_NAMES_H

#include <string>

const static int countRussianFirstNames = 90;
const static int countRussianLastNames = 90;
const static int countRussianPatronymics = 90;

const static std::string russianFirstNames[countRussianFirstNames] = {
    "Александр", "Максим", "Иван", "Артем", "Дмитрий",
    "Никита", "Михаил", "Даниил", "Егор", "Андрей",
    "Илья", "Алексей", "Кирилл", "Владимир", "Павел",
    "Роман", "Сергей", "Олег", "Тимофей", "Юрий",
    "Виктор", "Евгений", "Георгий", "Константин", "Николай",
    "Семен", "Антон", "Степан", "Анатолий", "Федор",
    "Борис", "Виталий", "Василий", "Владислав", "Леонид",
    "Геннадий", "Аркадий", "Григорий", "Валентин", "Глеб",
    "Денис", "Вячеслав", "Станислав", "Ярослав", "Захар",
    "Матвей", "Тарас", "Савелий", "Альберт", "Филипп",
    "Игнат", "Эдуард", "Ростислав", "Давид", "Мирон",
    "Валерий", "Марк", "Прохор", "Арсений", "Родион",
    "Юлиан", "Артемий", "Тимур", "Амир", "Игорь",
    "Лазарь", "Рубен", "Назар", "Макар", "Ратмир",
    "Марат", "Лев", "Оскар", "Самуил", "Сергей",
    "Ренат", "Серафим", "Тихон", "Вольдемар", "Эмиль",
    "Гордей", "Платон", "Петр", "Марк", "Сергей",
    "Фома", "Клим", "Елисей", "Трофим", "Юлий"
};

const static std::string russianLastNames[countRussianLastNames] = {
    "Иванов", "Петров", "Сидоров", "Кузнецов", "Смирнов",
    "Попов", "Васильев", "Соколов", "Михайлов", "Новиков",
    "Федоров", "Морозов", "Волков", "Алексеев", "Лебедев",
    "Семенов", "Егоров", "Павлов", "Козлов", "Степанов",
    "Николаев", "Орлов", "Андреев", "Макаров", "Никитин",
    "Захаров", "Зайцев", "Соловьев", "Борисов", "Яковлев",
    "Григорьев", "Романов", "Воробьев", "Сергеев", "Фомин",
    "Виноградов", "Кузьмин", "Максимов", "Киселев", "Маркелов",
    "Медведев", "Анисимов", "Григорьев", "Громов", "Суханов",
    "Маслов", "Шестаков", "Миронов", "Лобанов", "Карпов",
    "Афанасьев", "Власов", "Мельников", "Данилов", "Савельев",
    "Захаров", "Шестаков", "Львов", "Титов", "Дмитриев",
    "Калинин", "Масленников", "Рожков", "Зимин", "Никифоров",
    "Гончаров", "Ефимов", "Крылов", "Белов", "Молчанов",
    "Герасимов", "Фролов", "Сафонов", "Котов", "Гаврилов",
    "Ситников", "Тарасов", "Коновалов", "Буров", "Рыбаков",
    "Харитонов", "Зубков", "Корнилов", "Абрамов", "Андреев",
    "Федотов", "Беляков", "Кулагин", "Ильин", "Буров"
};

const static std::string russianPatronymics[countRussianPatronymics] = {
    "Александрович", "Михайлович", "Иванович", "Петрович", "Дмитриевич",
    "Алексеевич", "Сергеевич", "Васильевич", "Андреевич", "Юрьевич",
    "Федорович", "Олегович", "Николаевич", "Геннадиевич", "Егорович",
    "Павлович", "Максимович", "Ильич", "Степанович", "Григорьевич",
    "Викторович", "Константинович", "Аркадьевич", "Тимофеевич", "Владимирович",
    "Валентинович", "Валерьевич", "Романович", "Антонович", "Семенович",
    "Станиславович", "Ярославович", "Евгеньевич", "Артемович", "Борисович",
    "Леонидович", "Никитич", "Тарасович", "Филиппович", "Даниилович",
    "Савельевич", "Рубенович", "Владиславович", "Глебович", "Платонович",
    "Захарович", "Филимонович", "Кириллович", "Давидович", "Арсеньевич",
    "Георгиевич", "Анатольевич", "Гаврилович", "Алексеевич", "Петрович",
    "Фомич", "Лукич", "Яковлевич", "Елизарович", "Моисеевич",
    "Тихонович", "Сократович", "Феоктистович", "Леонидович", "Афанасьевич",
    "Игнатьевич", "Рудольфович", "Соломонович", "Кузьмич", "Геннадиевич",
    "Германович", "Юлианович", "Ростиславович", "Романович", "Рубенович",
    "Станиславович", "Эдгарович", "Эдуардович", "Александрович", "Игоревич",
    "Вадимович", "Олегович", "Маркович", "Митрофанович", "Эммануилович",
    "Игнатович", "Давидович", "Фадеевич", "Алексеевич", "Богданович"
};

#endif